test/pimpleFSIFoam_test/pimpleFSIFoam-obstacle/caseSetup/fluidDomain/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libfvMotionSolvers.so");

twoDMotion          no;

solver              displacementLaplacian;

diffusivity         quadratic inverseDistance 1(interface);

frozenDiffusion     yes;

distancePatches
(
    interface
);

// ************************************************************************* //